In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        "a": [4,5,6],
        "b": [7,8,9],
        "c": [10,11,12]
    },
    index=[1,2,3]
)

df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

In [3]:
df = pd.DataFrame( {
    "Name": ["Tejal", "Aditi", "Sneha"],
    "Age": [21,20,25],
    "Location": ["Mumbai", "Pune", "Nagpur"]
    
},
    index=[1,2,3]
)

In [4]:
df

    Name  Age Location
1  Tejal   21   Mumbai
2  Aditi   20     Pune
3  Sneha   25   Nagpur

In [5]:
df.head()

    Name  Age Location
1  Tejal   21   Mumbai
2  Aditi   20     Pune
3  Sneha   25   Nagpur

In [6]:
df.tail()

    Name  Age Location
1  Tejal   21   Mumbai
2  Aditi   20     Pune
3  Sneha   25   Nagpur

In [8]:
df.shape

(3, 3)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [10]:
df.describe()

             Age
count   3.000000
mean   22.000000
std     2.645751
min    20.000000
25%    20.500000
50%    21.000000
75%    23.000000
max    25.000000

In [12]:
df['Age'].max()

25

In [13]:
df['Age'].min()

20

In [14]:
df['Age'].mean()

np.float64(22.0)

In [15]:
df.drop_duplicates()

    Name  Age Location
1  Tejal   21   Mumbai
2  Aditi   20     Pune
3  Sneha   25   Nagpur

In [16]:
df = pd.DataFrame( {
    "Name": ["Tejal", "Aditi", "Sneha", "Anisha"],
    "Age": [21,20,25,35],
    "Location": ["Mumbai", "Pune", "Nagpur","America"]
    
},
    index=[1,2,3,4]
)

In [17]:
df

     Name  Age Location
1   Tejal   21   Mumbai
2   Aditi   20     Pune
3   Sneha   25   Nagpur
4  Anisha   35  America

In [18]:
df.drop_duplicates()

     Name  Age Location
1   Tejal   21   Mumbai
2   Aditi   20     Pune
3   Sneha   25   Nagpur
4  Anisha   35  America

In [19]:
df.loc[2]

Name        Aditi
Age            20
Location     Pune
Name: 2, dtype: object

In [22]:
df.iloc[0:]

     Name  Age Location
1   Tejal   21   Mumbai
2   Aditi   20     Pune
3   Sneha   25   Nagpur
4  Anisha   35  America

In [23]:
df.drop(3)

     Name  Age Location
1   Tejal   21   Mumbai
2   Aditi   20     Pune
4  Anisha   35  America

In [24]:
df[df.Age<25]

    Name  Age Location
1  Tejal   21   Mumbai
2  Aditi   20     Pune

In [25]:
df.isnull()

    Name    Age  Location
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False